# Built In Failures Import Failures ATFNon Uniform Scaling Transform Property

Source: https://www.revitapidocs.com/2026/20ac0edb-b4da-951b-db57-a1ce2c2fa59b.htm

---

| Built In Failures Import Failures ATFNon Uniform Scaling Transform Property |
| --- |

**Note: This API is now obsolete.**

The imported geometry contains non\-uniform scaling transformations which Revit does not support. Some objects may be displaced or distorted.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedTransform instead.")]
public static FailureDefinitionId ATFNonUniformScalingTransform { get; }
```

```
<ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedTransform instead.")>
Public Shared ReadOnly Property ATFNonUniformScalingTransform As FailureDefinitionId
	Get
```

```
public:
[ObsoleteAttribute(L"This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedTransform instead.")]
static property FailureDefinitionId^ ATFNonUniformScalingTransform {
	FailureDefinitionId^ get ();
}
```

```
[<ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedTransform instead.")>]
static member ATFNonUniformScalingTransform : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ImportFailures Class Autodesk.Revit.DB Namespace